app/Controllers/Main.php

SELECT *
FROM `products`
 LIMIT 10, 10
SELECT COUNT(*) AS `numrows`
FROM `products`
---
    public function products()
    {
        $this->data['page_title'] = "Products";
        $this->data['page'] =  !empty($this->request->getVar('page')) ? $this->request->getVar('page') : 1;
        $this->data['perPage'] =  10;
        $this->data['total'] =  $this->prod_model->countAllResults();
        $this->data['products'] = $this->prod_model->paginate($this->data['perPage']);

SELECT *
FROM `products`
WHERE `id` = '1'
 LIMIT 1
---
        }

        $this->data['page_title'] = "Edit Product";
        $this->data['product'] = $this->prod_model->where("id ='{$id}'")->first();

SELECT COUNT(*) AS `numrows`
FROM `transactions`
---
    public function transactions()
    {
        $this->data['page_title'] = "Transactions";
        $this->data['page'] =  !empty($this->request->getVar('page')) ? $this->request->getVar('page') : 1;
        $this->data['perPage'] =  10;
        $this->data['total'] =  $this->tran_model->countAllResults();
        $this->data['transactions'] = $this->tran_model
            ->select(" transactions.*, COALESCE((SELECT SUM(transaction_items.quantity) FROM transaction_items where transaction_id = transactions.id ), 0) as total_items")
            ->paginate($this->data['perPage']);